Tekla.Structures.ModelInternal.dotRebarSplice_t
Serialization structure for RebarSplice.

Tekla.Structures.ModelInternal.dotRebarSplice_t.ModelObject
Base class.

Tekla.Structures.ModelInternal.dotRebarSplice_t.Reinforcement1
The first reinforcement connected to the splice.

Tekla.Structures.ModelInternal.dotRebarSplice_t.Reinforcement2
The second reinforcement connected to the splice.

Tekla.Structures.ModelInternal.dotRebarSplice_t.Type
The type of splice.

Tekla.Structures.ModelInternal.dotRebarSplice_t.LapLength
Lap length of the lap type splice.

Tekla.Structures.ModelInternal.dotRebarSplice_t.Offset
Distance from the splice definition point along bar length.

Tekla.Structures.ModelInternal.dotRebarSplice_t.Clearance
Clearance between joined bars in case of the lap type splice.

Tekla.Structures.ModelInternal.dotRebarSplice_t.BarPositions
Value 0: Joined bars on top of each other in case of the lap type splice.
Value 1: Joined bars parallel to each other in case of the lap type splice.